<a href="https://colab.research.google.com/github/Jeongyoon-Jang/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88_12(8%EC%9B%941%EC%9D%BC).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
date_list = [{'date': '2000-06-27'},
             {'date': '2002-09-24'},
             {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [4]:
def extract_year(date):
  return date.split('-')[0]

In [5]:
df['year'] = df['date'].map(extract_year) # year이라는 column을 map함수를 이용해 만들기

In [6]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [7]:
job_list = [{'age': 20, 'job': 'student'},
            {'age': 30, 'job': 'developer'},
            {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [8]:
df.job = df.job.map({'student':1, "developer":2, "teacher":3}) # 문자를 숫자로 바꿔주는 경우 map함수를 써줌

In [9]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [10]:
x_y = [{'x': 5.5, 'y': -5.6, 'z': -1.1},
       {'x': -5.2, 'y': 5.5, 'z': -2.2},
       {'x':-1.6, 'y': -4.5, 'z': -3.3}]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [11]:
import numpy as np

In [12]:
df = df.applymap(np.around) # 데이터프레임 전체 바꾸기

In [13]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0